// 스코프(scope)
// 우리말로 '범위'를 뜻함
// 변수나 함수에 접근하거나 호출할 수 있는 범위를 말함

// 예
// function funcA(){
//     let a = 1;
// }

// console.log(a);
// a 는 지역 스코프여서 밖에서 알 수 없음

// -> 전역(전체 영역) 스코프 / 지역(특정 영역) 스코프
// -> 전역 스코프 : 전체 영역에서 접근 가능
// -> 지역 스코프 : 특정 영역에서만 접근 가능

let a = 1; // 전역 스코프

function funcA() {
    let b = 2; // 지역 스코프
    console.log(a);
}

funcA()
// console.log(b) // b는 지역 스코프이기에 함수 외부에서 호출할 수 없음

if (true) {
    let c = 1; // 얘도 블록 안에서 만들어진 변수이기에 지역 스코프
}

for (let i = 0; i < 10; i ++) {
    let d = 1; // 블록(중괄호) 안에서 만들어진 변수이기에 지역 스코프
}

console.log()

// 함수 선언문의 경우 함수 안에서만 지역 스코프를 갖고 조건문이나 반복문 안으로 들어가면 지역 스코프를 갖지 않음

